tiborsimon/embedded-tdd-headers/pic/pic18/pic18f25k50_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F25K50_H_
#define _PIC18F25K50_H_

#define SRCON1                        0
#define SRRC1E                        1
#define SRRC2E                        2
#define SRRCKE                        3
#define SRRPE                         4
#define SRSC1E                        5
#define SRSC2E                        6
#define SRSCKE                        7
#define SRSPE                         8
#define SRCON0                        9
#define SRPR                          10
#define SRPS                          11
#define SRNQEN                        12
#define SRQEN                         13
#define SRCLK0                        14
#define SRCLK                         15
#define SRCLK1                        16
#define SRCLK2                        17
#define SRLEN                         18
#define CCPTMRS                       19
#define C1TSEL                        20
#define C2TSEL                        21
#define VREGCON                       22
#define VREGPM                        23
#define ANSELA                        24
#define ANSA0                         25
#define ANSA1                         26
#define ANSA2                         27
#define ANSA3                         28
#define ANSA5                         29
#define ANSELB                        30
#define ANSB0                         31
#define ANSB1                         32
#define ANSB2                         33
#define ANSB3                         34
#define ANSB4                         35
#define ANSB5                         36
#define ANSELC                        37
#define ANSC2                         38
#define ANSC6                         39
#define ANSC7                         40
#define UCON                          41
#define SUSPND                        42
#define RESUME                        43
#define USBEN                         44
#define PKTDIS                        45
#define SE0                           46
#define PPBRST                        47
#define USTAT                         48
#define PPBI                          49
#define DIR                           50
#define ENDP                          51
#define ENDP0                         52
#define ENDP1                         53
#define ENDP2                         54
#define ENDP3                         55
#define UCFG                          56
#define PPB                           57
#define UPP0                          58
#define PPB0                          59
#define UPP1                          60
#define PPB1                          61
#define FSEN                          62
#define UTRDIS                        63
#define UPUEN                         64
#define UOEMON                        65
#define UTEYE                         66
#define UADDR                         67
#define ADDR                          68
#define ADDR0                         69
#define ADDR1                         70
#define ADDR2                         71
#define ADDR3                         72
#define ADDR4                         73
#define ADDR5                         74
#define ADDR6                         75
#define UIE                           76
#define URSTIE                        77
#define UERRIE                        78
#define ACTVIE                        79
#define TRNIE                         80
#define IDLEIE                        81
#define STALLIE                       82
#define SOFIE                         83
#define UIR                           84
#define URSTIF                        85
#define UERRIF                        86
#define ACTVIF                        87
#define TRNIF                         88
#define IDLEIF                        89
#define STALLIF                       90
#define SOFIF                         91
#define UEIE                          92
#define PIDEE                         93
#define CRC5EE                        94
#define CRC16EE                       95
#define DFN8EE                        96
#define BTOEE                         97
#define BTSEE                         98
#define UEIR                          99
#define PIDEF                         100
#define CRC5EF                        101
#define CRC16EF                       102
#define DFN8EF                        103
#define BTOEF                         104
#define BTSEF                         105
#define UFRML                         106
#define FRML                          107
#define FRM0                          108
#define UFRML_FRM                     109
#define FRM1                          110
#define FRM2                          111
#define FRM3                          112
#define FRM4                          113
#define FRM5                          114
#define FRM6                          115
#define FRM7                          116
#define UFRMH                         117
#define FRM8                          118
#define UFRMH_FRM                     119
#define FRM9                          120
#define FRM10                         121
#define UEP0                          122
#define UEP0_EPSTALL                  123
#define EP0STALL                      124
#define EPSTALL0                      125
#define UEP0_EPINEN                   126
#define EPINEN0                       127
#define EP0INEN                       128
#define UEP0_EPOUTEN                  129
#define EP0OUTEN                      130
#define EPOUTEN0                      131
#define EPCONDIS0                     132
#define EP0CONDIS                     133
#define UEP0_EPCONDIS                 134
#define UEP0_EPHSHK                   135
#define EP0HSHK                       136
#define EPHSHK0                       137
#define UEP1                          138
#define EPSTALL1                      139
#define EP1STALL                      140
#define UEP1_EPSTALL                  141
#define EPINEN1                       142
#define EP1INEN                       143
#define UEP1_EPINEN                   144
#define EPOUTEN1                      145
#define UEP1_EPOUTEN                  146
#define EP1OUTEN                      147
#define UEP1_EPCONDIS                 148
#define EP1CONDIS                     149
#define EPCONDIS1                     150
#define EPHSHK1                       151
#define EP1HSHK                       152
#define UEP1_EPHSHK                   153
#define UEP2                          154
#define EP2STALL                      155
#define EPSTALL2                      156
#define UEP2_EPSTALL                  157
#define EP2INEN                       158
#define EPINEN2                       159
#define UEP2_EPINEN                   160
#define EP2OUTEN                      161
#define UEP2_EPOUTEN                  162
#define EPOUTEN2                      163
#define EP2CONDIS                     164
#define UEP2_EPCONDIS                 165
#define EPCONDIS2                     166
#define EP2HSHK                       167
#define EPHSHK2                       168
#define UEP2_EPHSHK                   169
#define UEP3                          170
#define UEP3_EPSTALL                  171
#define EPSTALL3                      172
#define EP3STALL                      173
#define UEP3_EPINEN                   174
#define EPINEN3                       175
#define EP3INEN                       176
#define EP3OUTEN                      177
#define EPOUTEN3                      178
#define UEP3_EPOUTEN                  179
#define UEP3_EPCONDIS                 180
#define EP3CONDIS                     181
#define EPCONDIS3                     182
#define EPHSHK3                       183
#define UEP3_EPHSHK                   184
#define EP3HSHK                       185
#define UEP4                          186
#define EP4STALL                      187
#define EPSTALL4                      188
#define UEP4_EPSTALL                  189
#define UEP4_EPINEN                   190
#define EP4INEN                       191
#define EPINEN4                       192
#define UEP4_EPOUTEN                  193
#define EPOUTEN4                      194
#define EP4OUTEN                      195
#define EPCONDIS4                     196
#define EP4CONDIS                     197
#define UEP4_EPCONDIS                 198
#define EPHSHK4                       199
#define EP4HSHK                       200
#define UEP4_EPHSHK                   201
#define UEP5                          202
#define EP5STALL                      203
#define UEP5_EPSTALL                  204
#define EPSTALL5                      205
#define EPINEN5                       206
#define UEP5_EPINEN                   207
#define EP5INEN                       208
#define EPOUTEN5                      209
#define UEP5_EPOUTEN                  210
#define EP5OUTEN                      211
#define EPCONDIS5                     212
#define EP5CONDIS                     213
#define UEP5_EPCONDIS                 214
#define UEP5_EPHSHK                   215
#define EPHSHK5                       216
#define EP5HSHK                       217
#define UEP6                          218
#define EPSTALL6                      219
#define UEP6_EPSTALL                  220
#define EP6STALL                      221
#define EP6INEN                       222
#define UEP6_EPINEN                   223
#define EPINEN6                       224
#define EP6OUTEN                      225
#define EPOUTEN6                      226
#define UEP6_EPOUTEN                  227
#define UEP6_EPCONDIS                 228
#define EP6CONDIS                     229
#define EPCONDIS6                     230
#define EPHSHK6                       231
#define UEP6_EPHSHK                   232
#define EP6HSHK                       233
#define UEP7                          234
#define UEP7_EPSTALL                  235
#define EP7STALL                      236
#define EPSTALL7                      237
#define EP7INEN                       238
#define EPINEN7                       239
#define UEP7_EPINEN                   240
#define EP7OUTEN                      241
#define UEP7_EPOUTEN                  242
#define EPOUTEN7                      243
#define UEP7_EPCONDIS                 244
#define EP7CONDIS                     245
#define EPCONDIS7                     246
#define EPHSHK7                       247
#define UEP7_EPHSHK                   248
#define EP7HSHK                       249
#define UEP8                          250
#define EPSTALL8                      251
#define UEP8_EPSTALL                  252
#define UEP8_EPINEN                   253
#define EPINEN8                       254
#define UEP8_EPOUTEN                  255
#define EPOUTEN8                      256
#define UEP8_EPCONDIS                 257
#define EPCONDIS8                     258
#define UEP8_EPHSHK                   259
#define EPHSHK8                       260
#define UEP9                          261
#define EPSTALL9                      262
#define UEP9_EPSTALL                  263
#define EPINEN9                       264
#define UEP9_EPINEN                   265
#define UEP9_EPOUTEN                  266
#define EPOUTEN9                      267
#define UEP9_EPCONDIS                 268
#define EPCONDIS9                     269
#define UEP9_EPHSHK                   270
#define EPHSHK9                       271
#define UEP10                         272
#define EPSTALL10                     273
#define UEP10_EPSTALL                 274
#define EPINEN10                      275
#define UEP10_EPINEN                  276
#define UEP10_EPOUTEN                 277
#define EPOUTEN10                     278
#define EPCONDIS10                    279
#define UEP10_EPCONDIS                280
#define UEP10_EPHSHK                  281
#define EPHSHK10                      282
#define UEP11                         283
#define UEP11_EPSTALL                 284
#define EPSTALL11                     285
#define EPINEN11                      286
#define UEP11_EPINEN                  287
#define UEP11_EPOUTEN                 288
#define EPOUTEN11                     289
#define EPCONDIS11                    290
#define UEP11_EPCONDIS                291
#define UEP11_EPHSHK                  292
#define EPHSHK11                      293
#define UEP12                         294
#define EPSTALL12                     295
#define UEP12_EPSTALL                 296
#define UEP12_EPINEN                  297
#define EPINEN12                      298
#define EPOUTEN12                     299
#define UEP12_EPOUTEN                 300
#define EPCONDIS12                    301
#define UEP12_EPCONDIS                302
#define EPHSHK12                      303
#define UEP12_EPHSHK                  304
#define UEP13                         305
#define UEP13_EPSTALL                 306
#define EPSTALL13                     307
#define EPINEN13                      308
#define UEP13_EPINEN                  309
#define UEP13_EPOUTEN                 310
#define EPOUTEN13                     311
#define EPCONDIS13                    312
#define UEP13_EPCONDIS                313
#define EPHSHK13                      314
#define UEP13_EPHSHK                  315
#define UEP14                         316
#define UEP14_EPSTALL                 317
#define EPSTALL14                     318
#define EPINEN14                      319
#define UEP14_EPINEN                  320
#define UEP14_EPOUTEN                 321
#define EPOUTEN14                     322
#define EPCONDIS14                    323
#define UEP14_EPCONDIS                324
#define UEP14_EPHSHK                  325
#define EPHSHK14                      326
#define UEP15                         327
#define UEP15_EPSTALL                 328
#define EPSTALL15                     329
#define UEP15_EPINEN                  330
#define EPINEN15                      331
#define UEP15_EPOUTEN                 332
#define EPOUTEN15                     333
#define EPCONDIS15                    334
#define UEP15_EPCONDIS                335
#define UEP15_EPHSHK                  336
#define EPHSHK15                      337
#define SLRCON                        338
#define SLRA                          339
#define SLRB                          340
#define SLRC                          341
#define VREFCON2                      342
#define DACR0                         343
#define DACR                          344
#define DACR1                         345
#define DACR2                         346
#define DACR3                         347
#define DACR4                         348
#define VREFCON1                      349
#define DACNSS                        350
#define DACPSS                        351
#define DACPSS0                       352
#define DACPSS1                       353
#define DACOE                         354
#define DACLPS                        355
#define DACEN                         356
#define VREFCON0                      357
#define TSRNG                         358
#define TSEN                          359
#define FVRS                          360
#define FVRS0                         361
#define FVRS1                         362
#define FVRST                         363
#define FVREN                         364
#define PMD0                          365
#define TMR1MD                        366
#define SPI1MD                        367
#define TMR2MD                        368
#define SPI2MD                        369
#define TMR3MD                        370
#define ACTMD                         371
#define STMD                          372
#define USBMD                         373
#define UARTMD                        374
#define UART1MD                       375
#define PMD1                          376
#define EMBMD                         377
#define CCP1MD                        378
#define CCP2MD                        379
#define ADCMD                         380
#define CMP1MD                        381
#define CMP2MD                        382
#define CTMUMD                        383
#define MSSPMD                        384
#define SSP1MD                        385
#define MSSP1MD                       386
#define PORTA                         387
#define ULPWUIN                       388
#define AN0                           389
#define PORTA_RA0                     390
#define AN1                           391
#define PORTA_RA1                     392
#define AN2                           393
#define PORTA_RA2                     394
#define VREFM                         395
#define AN3                           396
#define PORTA_RA3                     397
#define VREFP                         398
#define PORTA_RA4                     399
#define T0CKI                         400
#define AN4                           401
#define PORTA_RA5                     402
#define LVDIN                         403
#define HLVDIN                        404
#define PORTA_RA6                     405
#define OSC2                          406
#define PORTA_RA7                     407
#define RJPU                          408
#define PORTB                         409
#define INT0                          410
#define PORTB_RB0                     411
#define INT1                          412
#define PORTB_RB1                     413
#define INT2                          414
#define PORTB_RB2                     415
#define CCP2_PA2                      416
#define PORTB_RB3                     417
#define PORTB_RB4                     418
#define PGM                           419
#define PORTB_RB5                     420
#define PGC                           421
#define PORTB_RB6                     422
#define PGD                           423
#define PORTB_RB7                     424
#define PORTC                         425
#define T13CKI                        426
#define T1OSO                         427
#define PORTC_RC0                     428
#define CCP2                          429
#define T1OSI                         430
#define PA2                           431
#define PORTC_RC1                     432
#define CCP1                          433
#define P1A                           434
#define PA1                           435
#define PORTC_RC2                     436
#define RC4                           437
#define RC5                           438
#define TX                            439
#define CK                            440
#define PORTC_RC6                     441
#define DT                            442
#define RX                            443
#define PORTC_RC7                     444
#define PORTE                         445
#define RE3                           446
#define PC3E                          447
#define CCP9E                         448
#define WPUB                          449
#define WPUB0                         450
#define WPUB1                         451
#define WPUB2                         452
#define WPUB3                         453
#define WPUB4                         454
#define WPUB5                         455
#define WPUB6                         456
#define WPUB7                         457
#define IOCB                          458
#define IOCB4                         459
#define IOCB5                         460
#define IOCB6                         461
#define IOCB7                         462
#define IOCC                          463
#define IOCC0                         464
#define IOCC1                         465
#define IOCC2                         466
#define IOCC4                         467
#define IOCC5                         468
#define IOCC6                         469
#define IOCC7                         470
#define CTMUICON                      471
#define IRNG                          472
#define IRNG0                         473
#define IRNG1                         474
#define ITRIM0                        475
#define ITRIM                         476
#define ITRIM1                        477
#define ITRIM2                        478
#define ITRIM3                        479
#define ITRIM4                        480
#define ITRIM5                        481
#define LATA                          482
#define LATA0                         483
#define LA0                           484
#define LATA1                         485
#define LA1                           486
#define LATA2                         487
#define LA2                           488
#define LATA3                         489
#define LA3                           490
#define LATA4                         491
#define LA4                           492
#define LATA5                         493
#define LA5                           494
#define LATA6                         495
#define LA6                           496
#define LATA7                         497
#define LA7                           498
#define LATB                          499
#define LB0                           500
#define LATB0                         501
#define LB1                           502
#define LATB1                         503
#define LB2                           504
#define LATB2                         505
#define LB3                           506
#define LATB3                         507
#define LB4                           508
#define LATB4                         509
#define LB5                           510
#define LATB5                         511
#define LB6                           512
#define LATB6                         513
#define LB7                           514
#define LATB7                         515
#define LATC                          516
#define LATC0                         517
#define LC0                           518
#define LATC1                         519
#define LC1                           520
#define LATC2                         521
