tiborsimon/embedded-tdd-headers/pic/pic18/pic18f25k50_tdd.h
#define DATA_ADDRESS                  1091
#define nA                            1092
#define D_A                           1093
#define D_nA                          1094
#define D                             1095
#define DA1                           1096
#define DA                            1097
#define D_NOT_A                       1098
#define nADDRESS                      1099
#define I2C_DAT                       1100
#define CKE                           1101
#define CKE1                          1102
#define SMP                           1103
#define SMP1                          1104
#define MSK0                          1105
#define SSP1ADD0                      1106
#define MSK01                         1107
#define SSP1ADD                       1108
#define MSK11                         1109
#define MSK1                          1110
#define SSP1ADD1                      1111
#define MSK2                          1112
#define MSK21                         1113
#define SSP1ADD2                      1114
#define MSK31                         1115
#define MSK3                          1116
#define SSP1ADD3                      1117
#define MSK4                          1118
#define MSK41                         1119
#define SSP1ADD4                      1120
#define MSK51                         1121
#define MSK5                          1122
#define SSP1ADD5                      1123
#define MSK6                          1124
#define SSP1ADD6                      1125
#define MSK61                         1126
#define MSK71                         1127
#define MSK7                          1128
#define SSP1ADD7                      1129
#define SSP1BUF                       1130
#define SSP1MSK0                      1131
#define SSP1MSK                       1132
#define SSP1MSK1                      1133
#define SSP1MSK2                      1134
#define SSP1MSK3                      1135
#define SSP1MSK4                      1136
#define SSP1MSK5                      1137
#define SSP1MSK6                      1138
#define SSP1MSK7                      1139
#define SSP1CON3                      1140
#define DHEN                          1141
#define AHEN                          1142
#define SBCDE                         1143
#define SDAHT                         1144
#define BOEN                          1145
#define SCIE                          1146
#define PCIE                          1147
#define ACKTIM                        1148
#define T1GCON                        1149
#define T1GSS0                        1150
#define T1GSS                         1151
#define T1GSS1                        1152
#define T1GVAL                        1153
#define T1GGO_nT1DONE                 1154
#define T1GGO_NOT_DONE                1155
#define T1GGO_nDONE                   1156
#define T1DONE                        1157
#define nT1DONE                       1158
#define T1GGO_NOT_T1DONE              1159
#define NOT_T1DONE                    1160
#define T1GGO                         1161
#define T1GSPM                        1162
#define T1GTM                         1163
#define T1GPOL                        1164
#define TMR1GE                        1165
#define T1CON                         1166
#define TMR1ON                        1167
#define T1CON_RD16                    1168
#define T1RD16                        1169
#define NOT_T1SYNC                    1170
#define T1SYNC                        1171
#define nT1SYNC                       1172
#define T1SOSCEN                      1173
#define T1CON_SOSCEN                  1174
#define T1OSCEN                       1175
#define T1CKPS0                       1176
#define T1CKPS                        1177
#define T1CKPS1                       1178
#define TMR1CS0                       1179
#define TMR1CS                        1180
#define TMR1CS1                       1181
#define TMR1L                         1182
#define TMR1H                         1183
#define RCON                          1184
#define BOR                           1185
#define NOT_BOR                       1186
#define nBOR                          1187
#define POR                           1188
#define nPOR                          1189
#define NOT_POR                       1190
#define PD                            1191
#define nPD                           1192
#define NOT_PD                        1193
#define NOT_TO                        1194
#define nTO                           1195
#define TO                            1196
#define nRI                           1197
#define NOT_RI                        1198
#define RI                            1199
#define SBOREN                        1200
#define IPEN                          1201
#define WDTCON                        1202
#define SWDTE                         1203
#define SWDTEN                        1204
#define OSCCON2                       1205
#define LFIOFS                        1206
#define HFIOFR                        1207
#define PRISD                         1208
#define SOSCGO                        1209
#define PLLEN                         1210
#define INTSRC                        1211
#define SOSCRUN                       1212
#define PLLRDY                        1213
#define OSCCON                        1214
#define SCS0                          1215
#define SCS                           1216
#define SCS1                          1217
#define FLTS                          1218
#define HFIOFS                        1219
#define OSTS                          1220
#define IRCF                          1221
#define IRCF0                         1222
#define IRCF1                         1223
#define IRCF2                         1224
#define IDLEN                         1225
#define T0CON                         1226
#define T0PS                          1227
#define T0PS0                         1228
#define T0PS1                         1229
#define T0PS2                         1230
#define PSA                           1231
#define T0SE                          1232
#define T0CS                          1233
#define T08BIT                        1234
#define TMR0ON                        1235
#define TMR0L                         1236
#define TMR0H                         1237
#define STATUS                        1238
#define C                             1239
#define CARRY                         1240
#define DC                            1241
#define ZERO                          1242
#define Z                             1243
#define OV                            1244
#define OVERFLOW                      1245
#define N                             1246
#define NEGATIVE                      1247
#define FSR2L                         1248
#define PLUSW2                        1249
#define PREINC2                       1250
#define POSTDEC2                      1251
#define POSTINC2                      1252
#define INDF2                         1253
#define FSR1L                         1254
#define PLUSW1                        1255
#define PREINC1                       1256
#define POSTDEC1                      1257
#define POSTINC1                      1258
#define INDF1                         1259
#define WREG                          1260
#define FSR0L                         1261
#define PLUSW0                        1262
#define PREINC0                       1263
#define POSTDEC0                      1264
#define POSTINC0                      1265
#define INDF0                         1266
#define INTCON3                       1267
#define INT1IF                        1268
#define INT1F                         1269
#define INT2IF                        1270
#define INT2F                         1271
#define INT1E                         1272
#define INT1IE                        1273
#define INT2IE                        1274
#define INT2E                         1275
#define INT1P                         1276
#define INT1IP                        1277
#define INT2IP                        1278
#define INT2P                         1279
#define INTCON2                       1280
#define IOCIP                         1281
#define TMR0IP                        1282
#define T0IP                          1283
#define INTEDG2                       1284
#define INTEDG1                       1285
#define INTEDG0                       1286
#define RBPU                          1287
#define NOT_RBPU                      1288
#define nRBPU                         1289
#define INTCON                        1290
#define IOCIF                         1291
#define INT0F                         1292
#define INT0IF                        1293
#define T0IF                          1294
#define TMR0IF                        1295
#define IOCIE                         1296
#define INT0E                         1297
#define INT0IE                        1298
#define T0IE                          1299
#define TMR0IE                        1300
#define PEIE                          1301
#define PEIE_GIEL                     1302
#define GIEL                          1303
#define GIEH                          1304
#define GIE_GIEH                      1305
#define GIE                           1306
#define PRODL                         1307
#define PRODH                         1308
#define TABLAT                        1309
#define TBLPTRL                       1310
#define TBLPTRH                       1311
#define PCL                           1312
#define PCLATH                        1313
#define PCH                           1314
#define SP0                           1315
#define STKPTR                        1316
#define SP1                           1317
#define SP2                           1318
#define SP3                           1319
#define SP4                           1320
#define STKUNF                        1321
#define STKOVF                        1322
#define STKFUL                        1323
#define TOSL                          1324
#define TOSH                          1325

#endif // _PIC18F25K50_H_
